Test/Jerome_Test/Framework/IIS/xml/cancelRequest_Synchronous.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m="http://www.tmforum.org/xsd/WsDgSamples/iterator/v1" xmlns:wsa="http://www.w3.org/2005/08/addressing" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/ http://www.tmforum.org/xsd/WsDgSamples/Iterator/v1 IteratorMessagesV1-0.xsd">
  <SOAP-ENV:Header>
    <wsa:To>http://host:port/iterator/sp</wsa:To>
    <wsa:Action>http://www.tmforum.org/wsdl/WsDgSamples/Iterator/v1-0/cancelRequest</wsa:Action>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <m:cancelRequest>
      <m:iteratorId>123456</m:iteratorId>
    </m:cancelRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
